Tekla Open API Reference for Tekla Structures 2025
ProfileSelectionForm Constructor
Overload List
Name | Description
ProfileSelectionForm(List<LibraryProfileItem>, List<ParametricProfileItem>)
 Creates a new instance of the ProfileSelectionForm.
ProfileSelectionForm(List<LibraryProfileItem>, List<ParametricProfileItem>, String)
 Creates a new instance of the ProfileSelectionForm selecting the given profile in the tree control.
Top
See Also
Reference
ProfileSelectionForm Class
Tekla.Structures.Dialog.UIControls Namespace